#అన్తర్భావ <stdio.h>
#అన్తర్భావ <string.h>
#అన్తర్భావ <locale.h>

పూర్ణాంకం
ప్రధాన (శూన్య)
{
  స్థిరరాశి అక్షరం t1[] = "0-0-0-0-0-0-0-0-0-0.COM";
  స్థిరరాశి అక్షరం t2[] = "00000-00000.COM";
  పూర్ణాంకం res1;
  పూర్ణాంకం res2;

  setlocale (LC_ALL, "en_US.ISO-8859-1");

  res1 = strcoll (t1, t2);
  రాయి ("strcoll (\"%s\", \"%s\") = %d\n", t1, t2, res1);
  res2 = strcoll (t2, t1);
  రాయి ("strcoll (\"%s\", \"%s\") = %d\n", t2, t1, res2);

  తిరిగి ((res1 == 0 && res2 != 0)
	  || (res1 != 0 && res2 == 0)
	  || (res1 < 0 && res2 < 0)
	  || (res1 > 0 && res2 > 0));
}
