/* Test for bug BZ #2703.  */
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <envz.h>
#अन्तर्भाव <stdlib.h>
#अन्तर्भाव <string.h>

स्थिर ध्रुव संरचना
{
  ध्रुव वर्ण *s;
  पूर्णाङ्क अन्तर्_परिणाम;
} strs[] =
{
  { "a=1", 1 },
  { "b=2", 1 },
  { "(*)", 0 },
  { "(*)", 0 },
  { "e=5", 1 },
  { "f=", 1 },
  { "(*)", 0 },
  { "h=8", 1 },
  { "i=9", 1 },
  { "j", 0 }
};

#परिभाषय nstrs (परिमाण (strs) / परिमाण (strs[0]))


पूर्णाङ्क
do_test (शून्य)
{

  size_t आकार = 0;
  वर्ण *str = स्मृतिं_देहि (100);
  यदि (str == रिक्त)
    {
      पङ्क्तिं_लिख ("out of memory");
      प्रत्यागम 1;
    }

  वर्ण **argz = &str;

  प्रति (पूर्णाङ्क i = 0; i < nstrs; ++i)
    argz_सङ्कलय_sep (argz, &आकार, strs[i].s, '\0');

  प्रारूप_लिख ("calling envz_strip with size=%zu\n", आकार);
  envz_strip (argz, &आकार);

  पूर्णाङ्क परिणाम = 0;
  प्रारूप_लिख ("new size=%zu\n", आकार);
  प्रति (पूर्णाङ्क i = 0; i < nstrs; ++i)
    यदि (strs[i].अन्तर्_परिणाम)
      {
        वर्ण name[2];
        name[0] = strs[i].s[0];
        name[1] = '\0';

        वर्ण *e = envz_प्रविष्टिः (*argz, आकार, name);
        यदि (e == रिक्त)
          {
            प्रारूप_लिख ("entry '%s' not found\n", name);
            परिणाम = 1;
          }
        अन्यथा यदि (वाक्यं_तुलय (e, strs[i].s) != 0)
          {
            प्रारूप_लिख ("entry '%s' does not match: is '%s', expected '%s'\n",
                    name, e, strs[i].s);
            परिणाम = 1;
          }
      }

  मुक्त (*argz);
  प्रत्यागम परिणाम;
}

#अन्तर्भाव <support/test-driver.c>
