#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>
#अन्तर्भाव <locale.h>

पूर्णाङ्क
main (शून्य)
{
  अचर वर्ण t1[] = "0-0-0-0-0-0-0-0-0-0.COM";
  अचर वर्ण t2[] = "00000-00000.COM";
  पूर्णाङ्क res1;
  पूर्णाङ्क res2;

  रखो_क्षेत्र (LC_ALL, "en_US.ISO-8859-1");

  res1 = strcoll (t1, t2);
  म_लिखो ("strcoll (\"%s\", \"%s\") = %d\n", t1, t2, res1);
  res2 = strcoll (t2, t1);
  म_लिखो ("strcoll (\"%s\", \"%s\") = %d\n", t2, t1, res2);

  फर्काऊ ((res1 == 0 && res2 != 0)
	  || (res1 != 0 && res2 == 0)
	  || (res1 < 0 && res2 < 0)
	  || (res1 > 0 && res2 > 0));
}
