/* Test for strverscmp() */

#अन्तर्भाव <stdlib.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>

#define  MAX_STRINGS      256
#define  MAX_ओळ_SIZE    32

स्थिर पूर्णांक
compare (स्थिरांक शून्य *p1, स्थिरांक शून्य *p2)
{
  परत strverscmp (*((अक्षर **) p1), *((अक्षर **) p2));
}

पूर्णांक
do_test (शून्य)
{
  अक्षर ओळ[MAX_ओळ_SIZE + 1];
  अक्षर *str[MAX_STRINGS];
  पूर्णांक  मोजणी = 0;
  पूर्णांक  i, n;

  पर्यंत (मोजणी < MAX_STRINGS && ख_माला_लो (ओळ, MAX_ओळ_SIZE, मानक_निवेश) != रिक्त)
    {
      n = म_माप (ओळ) - 1;

      जर (ओळ[n] == '\n')
        ओळ[n] = '\0';

      str[मोजणी] = strdup (ओळ);

      जर (str[मोजणी] == रिक्त)
        निकास (निकास_त्रुटि);

      ++मोजणी;
    }

  क्विक (str, मोजणी, आकार (अक्षर *), compare);

  साठी (i = 0; i < मोजणी; ++i)
    माला_दो (str[i]);

  परत निकास_सफल;
}

#अन्तर्भाव <support/test-driver.c>
