/* Make sure we don't test the optimized inline functions if we want to
   test the real implementation.  */
#अपरिभाषय __USE_STRING_INLINES

#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>

पूर्णाङ्क
do_test (शून्य)
{
  स्थिर ध्रुव size_t lens[] = { 0, 1, 0, 2, 0, 1, 0, 3,
				 0, 1, 0, 2, 0, 1, 0, 4 };
  वर्ण basebuf[24 + 32];
  size_t आधारः;

  प्रति (आधारः = 0; आधारः < 32; ++आधारः)
    {
      वर्ण *buf = basebuf + आधारः;
      size_t शब्दाः;

      प्रति (शब्दाः = 0; शब्दाः < 4; ++शब्दाः)
	{
	  size_t चरमः;
	  स्मृतिं_पूरय (buf, 'a', शब्दाः * 4);

	  प्रति (चरमः = 0; चरमः < 16; ++चरमः)
	    {
	      buf[शब्दाः * 4 + 0] = (चरमः & 1) != 0 ? 'b' : '\0';
	      buf[शब्दाः * 4 + 1] = (चरमः & 2) != 0 ? 'c' : '\0';
	      buf[शब्दाः * 4 + 2] = (चरमः & 4) != 0 ? 'd' : '\0';
	      buf[शब्दाः * 4 + 3] = (चरमः & 8) != 0 ? 'e' : '\0';
	      buf[शब्दाः * 4 + 4] = '\0';

	      यदि (वाक्यदैर्घ्यम् (buf) != शब्दाः * 4 + lens[चरमः])
		{
		  प्रारूप_लिख ("\
वाक्यदैर्घ्यम् failed प्रति आधारः=%zu, शब्दाः=%zu, and चरमः=%zu (is %zd, expected %zd)\n",
			  आधारः, शब्दाः, चरमः,
			  वाक्यदैर्घ्यम् (buf), शब्दाः * 4 + lens[चरमः]);
		  प्रत्यागम 1;
		}

	      यदि (strnlen (buf, -1) != शब्दाः * 4 + lens[चरमः])
		{
		  प्रारूप_लिख ("\
strnlen failed प्रति आधारः=%zu, शब्दाः=%zu, and चरमः=%zu (is %zd, expected %zd)\n",
			  आधारः, शब्दाः, चरमः,
			  strnlen (buf, -1), शब्दाः * 4 + lens[चरमः]);
		  प्रत्यागम 1;
		}
	    }
	}
    }
  प्रत्यागम 0;
}

#अन्तर्भाव <support/test-driver.c>
