/* Test for strverscmp() */

#అన్తర్భావ <stdlib.h>
#అన్తర్భావ <stdio.h>
#అన్తర్భావ <string.h>

#నిర్వచించు  MAX_అక్షరశ్రేణులు      256
#నిర్వచించు  MAX_పంక్తి_కొలత    32

స్థిర పూర్ణాంకం
compare (స్థిరరాశి శూన్య *p1, స్థిరరాశి శూన్య *p2)
{
  తిరిగి strverscmp (*((అక్షరం **) p1), *((అక్షరం **) p2));
}

పూర్ణాంకం
do_test (శూన్య)
{
  అక్షరం పంక్తి[MAX_పంక్తి_కొలత + 1];
  అక్షరం *str[MAX_అక్షరశ్రేణులు];
  పూర్ణాంకం  లెక్క = 0;
  పూర్ణాంకం  i, n;

  అయితే (లెక్క < MAX_అక్షరశ్రేణులు && fgets (పంక్తి, MAX_పంక్తి_కొలత, stdin) != ఖాళీ)
    {
      n = అక్షరశ్రేణి_పొడవు (పంక్తి) - 1;

      ఒకవేళ (పంక్తి[n] == '\n')
        పంక్తి[n] = '\0';

      str[లెక్క] = strdup (పంక్తి);

      ఒకవేళ (str[లెక్క] == ఖాళీ)
        నిష్క్రమించు (EXIT_FAILURE);

      ++లెక్క;
    }

  qsort (str, లెక్క, పరిమాణం (అక్షరం *), compare);

  కొరకు (i = 0; i < లెక్క; ++i)
    puts (str[i]);

  తిరిగి EXIT_SUCCESS;
}

#అన్తర్భావ <support/test-driver.c>
