/* Test for strverscmp() */

#ਅਨ੍ਤਰ੍ਭਾਵ <stdlib.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <string.h>

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ  MAX_ਲੜੀਆਂ      256
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ  MAX_ਸਤਰ_ਮਾਪ    32

ਸਥਿਰ ਪੂਰਨ
compare (ਅਚਲ ਖਾਲੀ *p1, ਅਚਲ ਖਾਲੀ *p2)
{
  ਵਾਪਸ strverscmp (*((ਅੱਖਰ **) p1), *((ਅੱਖਰ **) p2));
}

ਪੂਰਨ
do_test (ਖਾਲੀ)
{
  ਅੱਖਰ ਸਤਰ[MAX_ਸਤਰ_ਮਾਪ + 1];
  ਅੱਖਰ *str[MAX_ਲੜੀਆਂ];
  ਪੂਰਨ  ਗਿਣਤੀ_2 = 0;
  ਪੂਰਨ  i, n;

  ਜਦੋਂ (ਗਿਣਤੀ_2 < MAX_ਲੜੀਆਂ && fgets (ਸਤਰ, MAX_ਸਤਰ_ਮਾਪ, stdin) != ਨਿਰਾ)
    {
      n = ਲੜੀ_ਲੰਬਾਈ (ਸਤਰ) - 1;

      ਜੇ (ਸਤਰ[n] == '\n')
        ਸਤਰ[n] = '\0';

      str[ਗਿਣਤੀ_2] = strdup (ਸਤਰ);

      ਜੇ (str[ਗਿਣਤੀ_2] == ਨਿਰਾ)
        ਬਾਹਰ_ਨਿਕਲੋ (EXIT_FAILURE);

      ++ਗਿਣਤੀ_2;
    }

  qsort (str, ਗਿਣਤੀ_2, ਆਕਾਰ (ਅੱਖਰ *), compare);

  ਲਈ (i = 0; i < ਗਿਣਤੀ_2; ++i)
    puts (str[i]);

  ਵਾਪਸ EXIT_SUCCESS;
}

#ਅਨ੍ਤਰ੍ਭਾਵ <support/test-driver.c>
