/* Make sure we don't test the optimized inline functions if we want to
   test the real implementation.  */
#నిర్వచనం_రద్దు __USE_STRING_INLINES

#అన్తర్భావ <stdio.h>
#అన్తర్భావ <string.h>

పూర్ణాంకం
do_test (శూన్య)
{
  స్థిర స్థిరరాశి size_t lens[] = { 0, 1, 0, 2, 0, 1, 0, 3,
				 0, 1, 0, 2, 0, 1, 0, 4 };
  అక్షరం basebuf[24 + 32];
  size_t పునాది;

  కొరకు (పునాది = 0; పునాది < 32; ++పునాది)
    {
      అక్షరం *buf = basebuf + పునాది;
      size_t పదాలు;

      కొరకు (పదాలు = 0; పదాలు < 4; ++పదాలు)
	{
	  size_t చివరి;
	  memset (buf, 'a', పదాలు * 4);

	  కొరకు (చివరి = 0; చివరి < 16; ++చివరి)
	    {
	      buf[పదాలు * 4 + 0] = (చివరి & 1) != 0 ? 'b' : '\0';
	      buf[పదాలు * 4 + 1] = (చివరి & 2) != 0 ? 'c' : '\0';
	      buf[పదాలు * 4 + 2] = (చివరి & 4) != 0 ? 'd' : '\0';
	      buf[పదాలు * 4 + 3] = (చివరి & 8) != 0 ? 'e' : '\0';
	      buf[పదాలు * 4 + 4] = '\0';

	      ఒకవేళ (అక్షరశ్రేణి_పొడవు (buf) != పదాలు * 4 + lens[చివరి])
		{
		  రాయి ("\
అక్షరశ్రేణి_పొడవు failed కొరకు పునాది=%zu, పదాలు=%zu, and చివరి=%zu (is %zd, expected %zd)\n",
			  పునాది, పదాలు, చివరి,
			  అక్షరశ్రేణి_పొడవు (buf), పదాలు * 4 + lens[చివరి]);
		  తిరిగి 1;
		}

	      ఒకవేళ (strnlen (buf, -1) != పదాలు * 4 + lens[చివరి])
		{
		  రాయి ("\
strnlen failed కొరకు పునాది=%zu, పదాలు=%zu, and చివరి=%zu (is %zd, expected %zd)\n",
			  పునాది, పదాలు, చివరి,
			  strnlen (buf, -1), పదాలు * 4 + lens[చివరి]);
		  తిరిగి 1;
		}
	    }
	}
    }
  తిరిగి 0;
}

#అన్తర్భావ <support/test-driver.c>
