/* Test for strverscmp() */

#समावेश <stdlib.h>
#समावेश <stdio.h>
#समावेश <string.h>

#घोषणा  MAX_STRINGS      256
#घोषणा  MAX_पंक्ति_आकार    32

अटल पूर्णांक
compare (स्थिर व्योम *p1, स्थिर व्योम *p2)
{
  वापस strverscmp (*((अक्षर **) p1), *((अक्षर **) p2));
}

पूर्णांक
do_test (व्योम)
{
  अक्षर पंक्ति[MAX_पंक्ति_आकार + 1];
  अक्षर *str[MAX_STRINGS];
  पूर्णांक  गिनती = 0;
  पूर्णांक  i, n;

  जबतक (गिनती < MAX_STRINGS && ख_माला_लो (पंक्ति, MAX_पंक्ति_आकार, मानक_निवेश) != शून्य)
    {
      n = म_माप (पंक्ति) - 1;

      अगर (पंक्ति[n] == '\n')
        पंक्ति[n] = '\0';

      str[गिनती] = strdup (पंक्ति);

      अगर (str[गिनती] == शून्य)
        निकास (निकास_त्रुटि);

      ++गिनती;
    }

  क्विक (str, गिनती, माप (अक्षर *), compare);

  क्रम (i = 0; i < गिनती; ++i)
    माला_दो (str[i]);

  वापस निकास_सफल;
}

#समावेश <support/test-driver.c>
