/* Test for strverscmp() */

#अन्तर्भाव <stdlib.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>

#define  MAX_STRINGS      256
#define  MAX_पङ्क्ति_SIZE    32

स्थिर पूर्णाङ्क
compare (अचर शून्य *p1, अचर शून्य *p2)
{
  फर्काऊ strverscmp (*((वर्ण **) p1), *((वर्ण **) p2));
}

पूर्णाङ्क
do_test (शून्य)
{
  वर्ण पङ्क्ति[MAX_पङ्क्ति_SIZE + 1];
  वर्ण *str[MAX_STRINGS];
  पूर्णाङ्क  गन्ती = 0;
  पूर्णाङ्क  i, n;

  जबसम्म (गन्ती < MAX_STRINGS && ख_माला_लो (पङ्क्ति, MAX_पङ्क्ति_SIZE, मानक_निवेश) != रिक्त)
    {
      n = म_माप (पङ्क्ति) - 1;

      यदि (पङ्क्ति[n] == '\n')
        पङ्क्ति[n] = '\0';

      str[गन्ती] = strdup (पङ्क्ति);

      यदि (str[गन्ती] == रिक्त)
        निकास (निकास_त्रुटि);

      ++गन्ती;
    }

  क्विक (str, गन्ती, परिमाण (वर्ण *), compare);

  लागि (i = 0; i < गन्ती; ++i)
    माला_दो (str[i]);

  फर्काऊ निकास_सफल;
}

#अन्तर्भाव <support/test-driver.c>
