/* Test for strverscmp() */

#ಅನ್ತರ್ಭಾವ <stdlib.h>
#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <string.h>

#ವ್ಯಾಖ್ಯಾನಿಸು  MAX_ಅಕ್ಷರಸರಣಿಗಳು      256
#ವ್ಯಾಖ್ಯಾನಿಸು  MAX_ಸಾಲು_ಗಾತ್ರ    32

ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ
compare (ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *p1, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *p2)
{
  ಹಿಂತಿರುಗಿ strverscmp (*((ಅಕ್ಷರ **) p1), *((ಅಕ್ಷರ **) p2));
}

ಪೂರ್ಣಾಂಕ
do_test (ಶೂನ್ಯ)
{
  ಅಕ್ಷರ ಸಾಲು[MAX_ಸಾಲು_ಗಾತ್ರ + 1];
  ಅಕ್ಷರ *str[MAX_ಅಕ್ಷರಸರಣಿಗಳು];
  ಪೂರ್ಣಾಂಕ  ಎಣಿಕೆ_2 = 0;
  ಪೂರ್ಣಾಂಕ  i, n;

  ಆಗ (ಎಣಿಕೆ_2 < MAX_ಅಕ್ಷರಸರಣಿಗಳು && fgets (ಸಾಲು, MAX_ಸಾಲು_ಗಾತ್ರ, stdin) != ಖಾಲಿ)
    {
      n = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ (ಸಾಲು) - 1;

      ಆದರೆ (ಸಾಲು[n] == '\n')
        ಸಾಲು[n] = '\0';

      str[ಎಣಿಕೆ_2] = strdup (ಸಾಲು);

      ಆದರೆ (str[ಎಣಿಕೆ_2] == ಖಾಲಿ)
        ನಿರ್ಗಮಿಸು (EXIT_FAILURE);

      ++ಎಣಿಕೆ_2;
    }

  qsort (str, ಎಣಿಕೆ_2, ಗಾತ್ರ (ಅಕ್ಷರ *), compare);

  ಗಾಗಿ (i = 0; i < ಎಣಿಕೆ_2; ++i)
    puts (str[i]);

  ಹಿಂತಿರುಗಿ EXIT_SUCCESS;
}

#ಅನ್ತರ್ಭಾವ <support/test-driver.c>
