/* Test for strverscmp() */

#अन्तर्भाव <stdlib.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>

#परिभाषय  MAX_वाक्यानि      256
#परिभाषय  MAX_पङ्क्तिः_आकार    32

स्थिर पूर्णाङ्क
compare (ध्रुव शून्य *p1, ध्रुव शून्य *p2)
{
  प्रत्यागम strverscmp (*((वर्ण **) p1), *((वर्ण **) p2));
}

पूर्णाङ्क
do_test (शून्य)
{
  वर्ण पङ्क्तिः[MAX_पङ्क्तिः_आकार + 1];
  वर्ण *str[MAX_वाक्यानि];
  पूर्णाङ्क  गणनम् = 0;
  पूर्णाङ्क  i, n;

  यावत् (गणनम् < MAX_वाक्यानि && fgets (पङ्क्तिः, MAX_पङ्क्तिः_आकार, stdin) != रिक्त)
    {
      n = वाक्यदैर्घ्यम् (पङ्क्तिः) - 1;

      यदि (पङ्क्तिः[n] == '\n')
        पङ्क्तिः[n] = '\0';

      str[गणनम्] = strdup (पङ्क्तिः);

      यदि (str[गणनम्] == रिक्त)
        निर्गच्छ (EXIT_FAILURE);

      ++गणनम्;
    }

  शीघ्रं_क्रमय (str, गणनम्, परिमाण (वर्ण *), compare);

  प्रति (i = 0; i < गणनम्; ++i)
    पङ्क्तिं_लिख (str[i]);

  प्रत्यागम EXIT_SUCCESS;
}

#अन्तर्भाव <support/test-driver.c>
